# Створiть 3 рiзних функцiї (на ваш вибiр). Кожна з цих функцiй повинна повертати якийсь результат.
# Також створiть четверу ф-цiю, яка в тiлi викликає 3 попереднi, обробляє повернутий ними результат та також повертає результат.
# Таким чином ми будемо викликати 1 функцiю, а вона в своєму тiлi ще 3
def fx():
    return "x = 2 * 4 / "


def gx():
    return "1 + 5 + "


def hx():
    return "6 ** 2 - 3 "


def result_func():
    result_str = ""
    result_str += fx()
    result_str += gx()
    result_str += hx()
    print(result_str)


result_func()
